package com.rickjinny.leetcode;

/**
 * 38、外观数组
 * 给定一个正整数 n（1 <= n <= 30），输出外观数列的第 n 项。
 * 注意：整数序列中的每一项将表示为一个字符串。
 * [外观数组]：是一个整数序列，从数字1开始，序列中的每一项都是对前一项的描述。前五项如下：
 * 1. 1
 * 2. 11
 * 3. 21
 * 4. 1211
 * 5. 111221
 * 第一项是数字1
 * 描述前一项，这个数是 1 即 "一个1", 记作：11
 * 描述前一项，这个数是 11 即 "两个1", 记作：21
 * 描述前一项，这个数是 21 即 "一个2一个1", 记作：1211
 * 描述前一项，这个数是 1211 即 "一个1一个2两个1", 记作：111221
 *
 * 示例1：
 * 输入：1
 * 输出："1"
 *
 * 示例2：
 * 输入：4
 * 输出："1211"
 *
 */
public class T0038_count_and_say {

    public static void main(String[] args) {
        
    }
}
